# CompoundStructureLayer Constructor (CompoundStructureLayer)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructureLayer Constructor (CompoundStructureLayer)
CompoundStructureLayer Class See Also
---
Creates a copy of a compound structure layer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CompoundStructureLayer(
	CompoundStructureLayer cs
)
```

Visual Basic
---
```text
Public Sub New ( _
	cs As CompoundStructureLayer _
)
```

Visual C++
---
```text
public:
CompoundStructureLayer(
	CompoundStructureLayer^ cs
)
```

# ### Parameters
cs
    Type: Autodesk.Revit.DB..::..CompoundStructureLayer The compound structure to copy.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CompoundStructureLayer Class
CompoundStructureLayer Overload
Autodesk.Revit.DB Namespace